app/controllers/content_nodes_controller.rb

  def show_by_name
    @content_node = ContentNode.find(:first, :conditions => ["name = ?", params[:name]])
---
SELECT * FROM `content_nodes` WHERE (name = 'home') LIMIT 1

    def set_sections
      @sections = Section.find_ordered_parents
---
SELECT * FROM `sections` WHERE (parent_id IS NULL OR parent_id = 0) ORDER BY -rank DESC